
#### Terraform Format and Style 🖌`success`
<details><summary>Format Output</summary>

```


```

</details>

#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
random_password.password: Refreshing state... [id=none]
random_uuid.acadapr: Refreshing state... [id=63bd3ac7-9239-f65b-9812-d58f0b549ef0]
data.azurerm_client_config.current: Reading...
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD03N2U1MTFmNi0wNjgyLTQxZDMtYTg0MC03NjU2NTY2YzBjY2E7b2JqZWN0SWQ9MjEwZTI0N2YtYjExNC00MGVkLWEzYjQtNTA0Yjc1NDI3MDg0O3N1YnNjcmlwdGlvbklkPTI2MDg2MjNlLTMyNmUtNDc2NS05NWZjLWI4ZjY1YTVjM2NiMTt0ZW5hbnRJZD1kMTk5MzkwMS1iYjUxLTQ5MmYtOGUwZC01NzJiMTM4NGYzYTY=]
azurerm_resource_group.baseRG: Refreshing state... [id=/subscriptions/2608623e-326e-4765-95fc-b8f65a5c3cb1/resourceGroups/acapoker]
azurerm_log_analytics_workspace.acadapr: Refreshing state... [id=/subscriptions/2608623e-326e-4765-95fc-b8f65a5c3cb1/resourceGroups/acapoker/providers/Microsoft.OperationalInsights/workspaces/acapoker-law]
azurerm_key_vault.acadapr: Refreshing state... [id=/subscriptions/2608623e-326e-4765-95fc-b8f65a5c3cb1/resourceGroups/acapoker/providers/Microsoft.KeyVault/vaults/acapoker-KV]
azurerm_container_registry.acadapr: Refreshing state... [id=/subscriptions/2608623e-326e-4765-95fc-b8f65a5c3cb1/resourceGroups/acapoker/providers/Microsoft.ContainerRegistry/registries/acapokeracr]
azurerm_container_app_environment.acadapr: Refreshing state... [id=/subscriptions/2608623e-326e-4765-95fc-b8f65a5c3cb1/resourceGroups/acapoker/providers/Microsoft.App/managedEnvironments/acapoker-ace]
azurerm_key_vault_secret.aca-user: Refreshing state... [id=https://acapoker-kv.vault.azure.net/secrets/aca-user/7b7b01124daa417e87e97e0c43566bf5]
azurerm_key_vault_secret.aca-pass: Refreshing state... [id=https://acapoker-kv.vault.azure.net/secrets/aca-pass/94717d436715487d91f0af2c72538364]
azurerm_key_vault_secret.psql-user: Refreshing state... [id=https://acapoker-kv.vault.azure.net/secrets/psql-user/39045dbbf14d453b90981fea84f064ef]
azurerm_key_vault_secret.psql-pass: Refreshing state... [id=https://acapoker-kv.vault.azure.net/secrets/psql-pass/98656bc5f2854ec7b4e42ad26d0ceb7e]
azurerm_key_vault_secret.aca-url: Refreshing state... [id=https://acapoker-kv.vault.azure.net/secrets/aca-url/f3ef2bb8cc994ca7bd461ebbe933b6f0]
azurerm_postgresql_flexible_server.acadapr: Refreshing state... [id=/subscriptions/2608623e-326e-4765-95fc-b8f65a5c3cb1/resourceGroups/acapoker/providers/Microsoft.DBforPostgreSQL/flexibleServers/acadapr-psql]
azurerm_postgresql_flexible_server_database.acadapr: Refreshing state... [id=/subscriptions/2608623e-326e-4765-95fc-b8f65a5c3cb1/resourceGroups/acapoker/providers/Microsoft.DBforPostgreSQL/flexibleServers/acadapr-psql/databases/acadapr-db]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # azurerm_container_app.acadapr will be created
  + resource "azurerm_container_app" "acadapr" {
      + container_app_environment_id  = "/subscriptions/2608623e-326e-4765-95fc-b8f65a5c3cb1/resourceGroups/acapoker/providers/Microsoft.App/managedEnvironments/acapoker-ace"
      + custom_domain_verification_id = (sensitive value)
      + id                            = (known after apply)
      + latest_revision_fqdn          = (known after apply)
      + latest_revision_name          = (known after apply)
      + location                      = (known after apply)
      + name                          = "acapoker-aca"
      + outbound_ip_addresses         = (known after apply)
      + resource_group_name           = "acapoker"
      + revision_mode                 = "Single"

      + dapr {
          + app_id       = "63bd3ac7-9239-f65b-9812-d58f0b549ef0"
          + app_protocol = "http"
        }

      + ingress {
          + allow_insecure_connections = false
          + external_enabled           = false
          + fqdn                       = (known after apply)
          + target_port                = 80
          + transport                  = "auto"

          + traffic_weight {
              + latest_revision = false
              + percentage      = 100
            }
        }

      + template {
          + max_replicas    = 10
          + min_replicas    = (known after apply)
          + revision_suffix = (known after apply)

          + container {
              + cpu               = 0.25
              + ephemeral_storage = (known after apply)
              + image             = "mcr.microsoft.com/azuredocs/containerapps-helloworld:latest"
              + memory            = "0.5Gi"
              + name              = "acapoker-aca"
            }
        }
    }

  # azurerm_container_app_environment_dapr_component.acadapr will be created
  + resource "azurerm_container_app_environment_dapr_component" "acadapr" {
      + component_type               = "state.postgresql"
      + container_app_environment_id = "/subscriptions/2608623e-326e-4765-95fc-b8f65a5c3cb1/resourceGroups/acapoker/providers/Microsoft.App/managedEnvironments/acapoker-ace"
      + id                           = (known after apply)
      + ignore_errors                = false
      + init_timeout                 = "5s"
      + name                         = "acapoker-state"
      + scopes                       = [
          + "63bd3ac7-9239-f65b-9812-d58f0b549ef0",
        ]
      + version                      = "v1"

      + metadata {
          + name        = "connstring"
          + secret_name = "connstring"
        }

      + secret {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
    }

  # azurerm_key_vault.acadapr must be replaced
-/+ resource "azurerm_key_vault" "acadapr" {
      ~ access_policy                   = [
          ~ {
              - application_id          = ""
              - certificate_permissions = []
              - key_permissions         = []
              - storage_permissions     = []
                # (3 unchanged attributes hidden)
            },
        ]
      - enable_rbac_authorization       = false -> null
      - enabled_for_deployment          = false -> null
      - enabled_for_disk_encryption     = false -> null
      - enabled_for_template_deployment = false -> null
      ~ id                              = "/subscriptions/2608623e-326e-4765-95fc-b8f65a5c3cb1/resourceGroups/acapoker/providers/Microsoft.KeyVault/vaults/acapoker-KV" -> (known after apply)
      ~ name                            = "acapoker-KV" -> "acapoker-kv" # forces replacement
      - tags                            = {} -> null
      ~ vault_uri                       = "https://acapoker-kv.vault.azure.net/" -> (known after apply)
        # (7 unchanged attributes hidden)

      - network_acls {
          - bypass                     = "AzureServices" -> null
          - default_action             = "Allow" -> null
          - ip_rules                   = [] -> null
          - virtual_network_subnet_ids = [] -> null
        }
    }

  # azurerm_key_vault_secret.aca-pass must be replaced
-/+ resource "azurerm_key_vault_secret" "aca-pass" {
      ~ id                      = "https://acapoker-kv.vault.azure.net/secrets/aca-pass/94717d436715487d91f0af2c72538364" -> (known after apply)
      ~ key_vault_id            = "/subscriptions/2608623e-326e-4765-95fc-b8f65a5c3cb1/resourceGroups/acapoker/providers/Microsoft.KeyVault/vaults/acapoker-KV" # forces replacement -> (known after apply) # forces replacement
        name                    = "aca-pass"
      ~ resource_id             = "/subscriptions/2608623e-326e-4765-95fc-b8f65a5c3cb1/resourceGroups/acapoker/providers/Microsoft.KeyVault/vaults/acapoker-KV/secrets/aca-pass/versions/94717d436715487d91f0af2c72538364" -> (known after apply)
      ~ resource_versionless_id = "/subscriptions/2608623e-326e-4765-95fc-b8f65a5c3cb1/resourceGroups/acapoker/providers/Microsoft.KeyVault/vaults/acapoker-KV/secrets/aca-pass" -> (known after apply)
      - tags                    = {} -> null
      ~ version                 = "94717d436715487d91f0af2c72538364" -> (known after apply)
      ~ versionless_id          = "https://acapoker-kv.vault.azure.net/secrets/aca-pass" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # azurerm_key_vault_secret.aca-url must be replaced
-/+ resource "azurerm_key_vault_secret" "aca-url" {
      ~ id                      = "https://acapoker-kv.vault.azure.net/secrets/aca-url/f3ef2bb8cc994ca7bd461ebbe933b6f0" -> (known after apply)
      ~ key_vault_id            = "/subscriptions/2608623e-326e-4765-95fc-b8f65a5c3cb1/resourceGroups/acapoker/providers/Microsoft.KeyVault/vaults/acapoker-KV" # forces replacement -> (known after apply) # forces replacement
        name                    = "aca-url"
      ~ resource_id             = "/subscriptions/2608623e-326e-4765-95fc-b8f65a5c3cb1/resourceGroups/acapoker/providers/Microsoft.KeyVault/vaults/acapoker-KV/secrets/aca-url/versions/f3ef2bb8cc994ca7bd461ebbe933b6f0" -> (known after apply)
      ~ resource_versionless_id = "/subscriptions/2608623e-326e-4765-95fc-b8f65a5c3cb1/resourceGroups/acapoker/providers/Microsoft.KeyVault/vaults/acapoker-KV/secrets/aca-url" -> (known after apply)
      - tags                    = {} -> null
      ~ version                 = "f3ef2bb8cc994ca7bd461ebbe933b6f0" -> (known after apply)
      ~ versionless_id          = "https://acapoker-kv.vault.azure.net/secrets/aca-url" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # azurerm_key_vault_secret.aca-user must be replaced
-/+ resource "azurerm_key_vault_secret" "aca-user" {
      ~ id                      = "https://acapoker-kv.vault.azure.net/secrets/aca-user/7b7b01124daa417e87e97e0c43566bf5" -> (known after apply)
      ~ key_vault_id            = "/subscriptions/2608623e-326e-4765-95fc-b8f65a5c3cb1/resourceGroups/acapoker/providers/Microsoft.KeyVault/vaults/acapoker-KV" # forces replacement -> (known after apply) # forces replacement
        name                    = "aca-user"
      ~ resource_id             = "/subscriptions/2608623e-326e-4765-95fc-b8f65a5c3cb1/resourceGroups/acapoker/providers/Microsoft.KeyVault/vaults/acapoker-KV/secrets/aca-user/versions/7b7b01124daa417e87e97e0c43566bf5" -> (known after apply)
      ~ resource_versionless_id = "/subscriptions/2608623e-326e-4765-95fc-b8f65a5c3cb1/resourceGroups/acapoker/providers/Microsoft.KeyVault/vaults/acapoker-KV/secrets/aca-user" -> (known after apply)
      - tags                    = {} -> null
      ~ version                 = "7b7b01124daa417e87e97e0c43566bf5" -> (known after apply)
      ~ versionless_id          = "https://acapoker-kv.vault.azure.net/secrets/aca-user" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # azurerm_key_vault_secret.psql-pass must be replaced
-/+ resource "azurerm_key_vault_secret" "psql-pass" {
      ~ id                      = "https://acapoker-kv.vault.azure.net/secrets/psql-pass/98656bc5f2854ec7b4e42ad26d0ceb7e" -> (known after apply)
      ~ key_vault_id            = "/subscriptions/2608623e-326e-4765-95fc-b8f65a5c3cb1/resourceGroups/acapoker/providers/Microsoft.KeyVault/vaults/acapoker-KV" # forces replacement -> (known after apply) # forces replacement
        name                    = "psql-pass"
      ~ resource_id             = "/subscriptions/2608623e-326e-4765-95fc-b8f65a5c3cb1/resourceGroups/acapoker/providers/Microsoft.KeyVault/vaults/acapoker-KV/secrets/psql-pass/versions/98656bc5f2854ec7b4e42ad26d0ceb7e" -> (known after apply)
      ~ resource_versionless_id = "/subscriptions/2608623e-326e-4765-95fc-b8f65a5c3cb1/resourceGroups/acapoker/providers/Microsoft.KeyVault/vaults/acapoker-KV/secrets/psql-pass" -> (known after apply)
      - tags                    = {} -> null
      ~ version                 = "98656bc5f2854ec7b4e42ad26d0ceb7e" -> (known after apply)
      ~ versionless_id          = "https://acapoker-kv.vault.azure.net/secrets/psql-pass" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # azurerm_key_vault_secret.psql-user must be replaced
-/+ resource "azurerm_key_vault_secret" "psql-user" {
      ~ id                      = "https://acapoker-kv.vault.azure.net/secrets/psql-user/39045dbbf14d453b90981fea84f064ef" -> (known after apply)
      ~ key_vault_id            = "/subscriptions/2608623e-326e-4765-95fc-b8f65a5c3cb1/resourceGroups/acapoker/providers/Microsoft.KeyVault/vaults/acapoker-KV" # forces replacement -> (known after apply) # forces replacement
        name                    = "psql-user"
      ~ resource_id             = "/subscriptions/2608623e-326e-4765-95fc-b8f65a5c3cb1/resourceGroups/acapoker/providers/Microsoft.KeyVault/vaults/acapoker-KV/secrets/psql-user/versions/39045dbbf14d453b90981fea84f064ef" -> (known after apply)
      ~ resource_versionless_id = "/subscriptions/2608623e-326e-4765-95fc-b8f65a5c3cb1/resourceGroups/acapoker/providers/Microsoft.KeyVault/vaults/acapoker-KV/secrets/psql-user" -> (known after apply)
      - tags                    = {} -> null
      ~ version                 = "39045dbbf14d453b90981fea84f064ef" -> (known after apply)
      ~ versionless_id          = "https://acapoker-kv.vault.azure.net/secrets/psql-user" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

Plan: 8 to add, 0 to change, 6 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```

</details>

*Pusher: @Joey40, Action: `pull_request`, Workflow: `Terraform Plan/Apply`*